Курс_ЕДТ_Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Курс_ЕДТ_Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьСписокПрав() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	НаборРолей = Метаданные.Роли;
	
	СписокПрав.Очистить();
	
	Для Каждого Роль Из НаборРолей Цикл
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли = Роль.Имя;
		СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
		СтрокаРоли.Включено = Пользователь.Роли.Содержит(Роль);
	КонецЦикла;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = ПолноеИмя;		
	КонецЕсли;
	
	Пользователь.Роли.Очистить();
	
	СписокРолей = СписокПрав.НайтиСтроки( Новый Структура(1+"Включено", Истина) );
	
	Для Каждого Роль Из СписокРолей Цикл
		Пользователь.Роли.Добавить( Метаданные.Роли.Найти(Роль.ИмяРоли) );
	КонецЦикла;
	
	Пользователь.Записать();
	
КонецПроцедуры
